بسم الله الرحمن الرحيم

In [2]:
import pandas as pd
import numpy as np
from pandas import Series
obj = Series([4, 5, 6, 7])
type(obj)

pandas.core.series.Series

In [3]:
print(obj)

0    4
1    5
2    6
3    7
dtype: int64

In [4]:
obj.values

array([4, 5, 6, 7])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj[0]

np.int64(4)

In [ ]:
obj2 = Series([6, 3, 2, 1], index=['a','b', 'c', 'd'])
obj2
obj2[['a', 'b', 'c']]

In [13]:
obj2[obj2>2]

a    6
b    3
dtype: int64

In [14]:
obj2[obj2<2]

d    1
dtype: int64

In [15]:
obj2*2

a    12
b     6
c     4
d     2
dtype: int64

In [17]:
np.exp(obj2)

a    403.428793
b     20.085537
c      7.389056
d      2.718282
dtype: float64

In [18]:
cars_dict = {'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000}

In [20]:
type(cars_dict)

dict

In [23]:
cars1 =Series(cars_dict)

In [26]:
cars1=Series({'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000})

In [28]:
'Malibu' in cars1

True

In [29]:
cars1['Toyota']

np.int64(45000)

In [30]:
models =['Honda', 'Mazda', 'Lacetti', 'Jaguar', 'Malibu', 'Toyota']

In [31]:
cars2 = Series(cars_dict, index=models)

In [32]:
cars2

Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
dtype: float64

In [33]:
cars2.isnull()

Honda      False
Mazda      False
Lacetti    False
Jaguar      True
Malibu     False
Toyota     False
dtype: bool

In [35]:
cars2.notnull()

Honda       True
Mazda       True
Lacetti     True
Jaguar     False
Malibu      True
Toyota      True
dtype: bool

In [37]:
cars1+cars2

Honda       76000.0
Jaguar          NaN
Lacetti     40000.0
Malibu      80000.0
Mazda      104000.0
Toyota      90000.0
dtype: float64

In [38]:
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [40]:
cars2.name ='Avtosalon'

In [42]:
cars2.index.name ='Modellar'

In [43]:
cars2

Modellar
Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
Name: Avtosalon, dtype: float64

In [45]:
cars2.hasnans

True

In [46]:
cars2.is_unique

True

In [47]:
cars2.shape

(6,)

In [48]:
cars2.size

6

In [49]:
cars2.mean()

np.float64(39000.0)